Revit 2027 API
FormulaManager.GetOperators Method
 Gets list of operator names supported by formula engine
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<string> GetOperators()
Public Shared Function GetOperators As IList(Of String)
public:
static IList<String^>^ GetOperators()
static member GetOperators : unit -> IList<string>
Return Value
IList<String>
See Also
Reference
FormulaManager Class
Autodesk.Revit.DB Namespace